from time import sleep
import random

def delayPrint(s):
  for c in s:
    print(c, end='', flush=True)
    sleep(0.025)
  print('')


character_name = str(input("Введіть ім'я персонажа: "))

if(len(character_name) > 18):
  delayPrint("Ім'я персонажа задовге")

delayPrint(f"{character_name} прокидається в темній лісовій гущині, неподалік від чарівного фонтану. Навколо слухаються звуки природи\nі гравець відчуває палке бажання знайти дорогу назад додому.\n")

choice = int(input("1. Піти до фонтану і попросити про дорогу.\n2. Відправитися вглиб лісу, шукати сліди або пригоди.\n"))

if choice == 1:
  delayPrint("Ви знайшли вхід у гномівське селище. Тут вас вітають веселі гноми, які запрошують вас на свято\nта ви дізнаєтесь, що гноми вироблять найкраще пиво у всьому королівстві.\n")
  village_choice = int(input("1. Прийняти участь у різних конкурсах і випити пива.\n2. Почати розслідування загрози дракона та допомогти гномам готуватися до битви.\n"))
  if village_choice == 1:
    delayPrint(f"{character_name} вирішив прийняти участь у різних конкурсах під час пивного фестивалю. Гноми радісно вітають його і проводять до арени, де проходять конкурси та веселощі.")
    festival_choice = int(input("1. Піти пограти в дартс.\n2. Піти з гномами святкувати день народження Геральта з Рівії.\n"))
    if festival_choice == 1:
      points = random.randint(0, 10)
      if points >= 5:
        delayPrint("Ви виграли в дартсі та отримали сертифікат на безлімітне пиво на все життя.")
      else:
        delayPrint("П'яний гном випадково попав вам в голову дротиком та ви померли.")
    elif festival_choice == 2:
      delayPrint("На дні народженні Геральта була Йеніфер, випивши пива вона випадково створила портал під вами де ви телепортувались в лаву. Ви померли")
  elif village_choice == 2:
    delayPrint("Місцевий гном розказав вам, що через кілька днів дракон планує зруйнувати селище та просить допомоги щоб перемогти його.")
    prepare_choice = int(input("1. Розробити план та підготуватися до битви проти дракона.\n2. Відмовитись допомагати гномам.\n"));
    if prepare_choice == 1:
      delayPrint("Ви підготувались до битви та перемогли Смертокрила. Вам дали доступ до безлімітного пива")
    elif prepare_choice == 2:
      delayPrint("Ви відмовились допомагати гномам. Смертокрил знищив все селище разом з його жителями.")
elif choice == 2:
  delayPrint("Ви натрапили на старовинний кам'яний міст через потік. По іншому боці мосту вас чекає загадковий прохожий в мантії з свинями\nПрохожий розповідає гравцеві, що ліс це місце, де збереглися давні скарби та загадки, і що він може вести гравця в саме серце пригод.")
  forest_choice = int(input("1.Погодитися і піти з прохожим глибше в ліс.\n2.Відмовитися і повернутися назад.\n"))
  if forest_choice == 1:
    delayPrint(f"{character_name} потрапляє в дуже загадкове і чарівне місце, де знаходяться руїни стародавнього храму. Всередині храму вас чекають древні пам'ятки та магічні загадки.")
    temple_choice = int(input("1.Розгадати магічний загадку і отримати нагороду.\n2.Подивитись на статую гнома\n"))
    if temple_choice == 1:
      delayPrint("Ви розгадали загадку та отримали дар перетворювати воду у пиво.\n")
    elif temple_choice == 2:
      delayPrint("Ви вирішили подивитись на статую гнома, але несподівано вона ожила та вбила вас молотом.\n")
  elif forest_choice == 2:
    delayPrint("Ви повернулися назад де на вас чекав велетень з Скайріму, він вдарив вас своєї палицею та відправив літати в космос де ви і померли.")